app/controllers/tasks_controller.rb

  def index
    @task = Task.all
---
SELECT "tasks".* FROM "tasks"

  def create
    @task = Task.new(task_params)

    if @task.save
---
INSERT INTO "tasks" ("title", "detail", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "uptecweb"], ["detail", "salvou?"], ["created_at", "2016-03-12 18:26:13.496973"], ["updated_at", "2016-03-12 18:26:13.496973"]]

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "title" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["title", "Task test**"], ["updated_at", "2016-03-17 16:09:24.921004"], ["id", 10]]

    def find_task_params
      @task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 2]]